//////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////
////                                                      ////
////    ███████╗ ██████╗██╗   ██╗  ██╗██████╗ ██████╗     ////
////    ██╔════╝██╔════╝██║   ██║  ██║██╔══██╗██╔══██╗    ////
////    ███████╗██║     ██║   ███████║██████╔╝██████╔╝    ////
////    ╚════██║██║     ██║   ██╔══██║██╔═══╝ ██╔═══╝     ////
////    ███████║╚██████╗██║██╗██║  ██║██║     ██║         ////
////    ╚══════╝ ╚═════╝╚═╝╚═╝╚═╝  ╚═╝╚═╝     ╚═╝         ////
////                                                      ////
////                (A cri5me™ production)                ////
////                                                      ////
//////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////



// TODO: Add BitSet type
// TODO: Maybe less dependence on standard 
//       headers? would be nice..
// TODO: Improve/Expand Allocators
//		  - realloc?
// TODO: Add more string functions
//		  - strview -- I no longer recall what this was meant to do lol
// TODO: Add (more) file I/O
// TODO: Add high-water mark to Temporary_Storage
// TODO: Add fallback allocation with logging 
//		 (optional) to Temporary_Storage
// TODO: Add tmark and treset to Temporary_Storage?
// TODO: Add a debug memory allocator that can be used
// 		 as a wrapper around any Allocator* that provides
//		 some behind-the-scenes bookkeeping in order
//		 to detect things like leaks, double-frees, etc.
// TODO: Add an option for Arena*s to use guard pages
// TODO: Add binary read/write helpers
// TODO: Add string builder
//		  - maybe this uses the binary read/write thing?
//		  - or maybe the binary read/write thing uses this?
// TODO: Add hexdump printer
// TODO: Add a base64 codec
// TODO: Add RLE codec
// TODO: Add intel hex encoder
// 	 	  - Also SRec?
// TODO: Add sorting functions for Array<T>, etc.
// TODO: Add some logging stuff maybe?
// TODO: Add a segment tree
// TODO: Add a "Sparse Set" (the funky one w/ uninit memory)
//		   - Also, "Sparse Map", because it's free to add ^
// TODO: Maybe have some form of 32-bit support? :/
// TODO: Add more filesystem helper stuff?
// TODO: Make sure this stuff works on winderps..... :/
// TODO: Add bignum structs
//		  - BigInt
//		  - BigRat?
//		  - BigDecimal?
//		  - Maybe also special things like u128/s128?
//			- May be a thing that already exists for larger
//			  CPU registers/SIMD *shrugs*
// TODO: Add a JSON parser/printer and "object model", as it were.
// TODO: Make xnew/xanew support arrays
// TODO: Add intrinsics wrappers



////////////////////////////////////
////////////////////////////////////
///            HEADER            ///
////////////////////////////////////
////////////////////////////////////



#ifndef SCI_H
#define SCI_H


/////////////////////
///    General    ///
/////////////////////


#include <stdlib.h>
#include <stdio.h> 
#include <stdarg.h>
#include <stddef.h>
#include <string.h>
#include <setjmp.h>
#include <assert.h>

#ifdef SCI_TESTING
#include <unistd.h>
#include <sys/wait.h>
#endif


#ifndef SCI_DEF
#define SCI_DEF extern
#endif


#ifndef __cplusplus
#error "Must compile as C++"
#endif


#if defined(_MSC_VER)
#define SCI_CC_MSVC
#elif defined(__clang__)
#define SCI_CC_CLANG
#elif defined(__GNUC__)
#define SCI_CC_GCC
#elif defined(__EMSCRIPTEN__)
#error "Emscripten not supported!"
#elif defined(__MINGW32__) || defined(__MINGW64__)
#error "MinGW not yet supported!"
#else
#error "Unknown compiler!"
#endif


#if defined(__linux__)
#define SCI_OS_LINUX
#elif defined(_WIN32) || defined(_WIN64)
#define SCI_OS_WINDOWS
#elif defined(__APPLE__) && defined(__MACH__)
#define SCI_OS_OSX
#else
#error "Unknown operating system!"
#endif


#define INTEGRAL_TYPES(X)      \
    X(u8, unsigned char)       \
    X(u16, unsigned short)     \
    X(u32, unsigned int)       \
    X(u64, unsigned long long) \
    X(s8, signed char)         \
    X(s16, signed short)       \
    X(s32, signed int)         \
    X(s64, signed long long)

#define FLOAT_TYPES(X) \
    X(f32, float)      \
    X(f64, double) 

#define X(name, ctype) using name = ctype;
INTEGRAL_TYPES(X)
FLOAT_TYPES(X)
#undef X


// Don't @ me.
static_assert(sizeof(u8)  == 1);
static_assert(sizeof(s8)  == 1);
static_assert(sizeof(u16) == 2);
static_assert(sizeof(s16) == 2);
static_assert(sizeof(u32) == 4);
static_assert(sizeof(s32) == 4);
static_assert(sizeof(u64) == 8);
static_assert(sizeof(s64) == 8);
static_assert(sizeof(f32) == 4);
static_assert(sizeof(f64) == 8);


#define CAT2(a, b) a##b
#define CAT(a, b) CAT2(a, b)


#define array_length(a) ((sizeof(a))/(sizeof(a[0])))
#define cast(t, v) ((t)(v))
#define unused(x) ((void)x)


#ifndef NULL
#define NULL 0
#endif


#ifndef offsetof
#define offsetof(type, member) ((u64)&(((type*)0)->member))
#endif


// TODO
#define nvrreturn 	  __attribute__((noreturn))
#define nvrinline 	  __attribute__((noinline))
#define forceinline	  __attribute__((always_inline))
#define static_init   __attribute__((constructor))
#define static_deinit __attribute__((destructor))


// TODO
#define debug_trap __builtin_trap
#define unreachable __builtin_unreachable


#ifndef PATH_SEPARATOR
#ifdef _WIN32
#define PATH_SEPARATOR '\\'
#else
#define PATH_SEPARATOR '/'
#endif
#endif


template<typename T>
void swap(T *a, T *b) {
	T c = *a;
	*a = *b;
	*b = c;
}

template<typename T>
void swap(T& a, T& b) {
	T c = a;
	a = b;
	b = c;
}


//////////////////////
///    Sections    ///
//////////////////////


